In [48]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm',
                    'Budapest_PaRis', 'Brussels_londOn'],
                    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                    '12. Air France', '"Swiss Air"']})
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

"""1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).
"""

In [55]:
df["FlightNumber"].fillna(value={1:10055,3:10075}, inplace=True)
df["FlightNumber"].astype(int)

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

In [56]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [71]:
"""2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.
"""

'2. The From_To column would be better as two separate columns! Split each\nstring on the underscore delimiter _ to give a new temporary DataFrame with\nthe correct values. Assign the correct column names to this temporary\nDataFrame.\n'

In [14]:
From =[]
for i in range(5):
    x=df["From_To"][i].split('_')[0]
    From.append(x)
From

['LoNDon', 'MAdrid', 'londON', 'Budapest', 'Brussels']

In [15]:
df["From_To"][0].split('_')[1]

'paris'

In [16]:
To =[]
for i in range(5):
    x=df["From_To"][i].split('_')[1]
    To.append(x)
To

['paris', 'miLAN', 'StockhOlm', 'PaRis', 'londOn']

In [60]:
temp=pd.DataFrame({"From":From, "To":To})
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [61]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [72]:
"""3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)
"""

'3. Notice how the capitalisation of the city names is all mixed up in this\ntemporary DataFrame. Standardise the strings so that only the first letter is\nuppercase (e.g. "londON" should become "London".)\n'

In [62]:
lst=[]
for i in range(5):
    a=temp["From"][i].capitalize()
    lst.append(a)
lst

['London', 'Madrid', 'London', 'Budapest', 'Brussels']

In [63]:
lst1=[]
for i in range(5):
    a=temp["To"][i].capitalize()
    lst1.append(a)
lst1

['Paris', 'Milan', 'Stockholm', 'Paris', 'London']

In [67]:
temp["From"]=lst
temp["To"]=lst1

temp

In [68]:
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [73]:
"""4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions."""

'4. Delete the From_To column from df and attach the temporary DataFrame\nfrom the previous questions.'

In [69]:
df = df.drop('From_To', axis=1)
df = df.join(temp)

df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1       10055.0            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3       10075.0          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London

In [74]:
"""5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each 
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays."""

"5. In the RecentDelays column, the values have been entered into the\nDataFrame as a list. We would like each first value in its own column, each \nsecond value in its own column, and so on. If there isn't an Nth value, the value\nshould be NaN.\nExpand the Series of lists into a DataFrame named delays, rename the columns\ndelay_1, delay_2, etc. and replace the unwanted RecentDelays column in df\nwith delays."

In [70]:
delays = df['RecentDelays'].apply(pd.Series)

delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]

df = df.drop('RecentDelays', axis=1).join(delays)

df

,FlightNumber,Airline,From,To,delay_1,delay_2,delay_3
0,10045.0,KLM(!),London,Paris,23.0,47.0,NaN
1,10055.0,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065.0,(British Airways. ),London,Stockholm,24.0,43.0,87.0
3,10075.0,12. Air France,Budapest,Paris,13.0,NaN,NaN
4,10085.0,"""Swiss Air""",Brussels,London,67.0,32.0,NaN